test/multiLevelBlock/generateData/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          10000;
        startFace       2970000;
    }
    back
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          10000;
        startFace       2980000;
    }
    inlet
    {
        type            patch;
        nFaces          10000;
        startFace       2990000;
    }
    outlet
    {
        type            patch;
        nFaces          10000;
        startFace       3000000;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          10000;
        startFace       3010000;
    }
    upperWall
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          10000;
        startFace       3020000;
    }
)

// ************************************************************************* //
